app/Controllers/Dashboard.php

    public function allPRF()
    {
        $builder = $this->db->table('tblprf');
        $builder->select('OrderNo,DateNeeded');
        $builder->WHERE('Status<>',3);
        $builder->orderBy('prfID','DESC');
        $builder->limit(10);
        $data = $builder->get();
---
SELECT `OrderNo`, `DateNeeded`
FROM `tblprf`
WHERE `Status` <> 3
ORDER BY `prfID` DESC
 LIMIT 10

    public function allPO()
    {
        $builder = $this->db->table('tbldelivery_info');
        $builder->select('purchaseNumber,ExpectedDate');
        $builder->WHERE('DeliveryStatus','For Delivery');
        $builder->limit(10);
        $data = $builder->get();
---
SELECT `purchaseNumber`, `ExpectedDate`
FROM `tbldelivery_info`
WHERE `DeliveryStatus` = 'For Delivery'
 LIMIT 10

    public function emergencyPRF()
    {
        $builder = $this->db->table('tblprf');
        $builder->select('OrderNo, Reason, DateNeeded');
        $builder->WHERE('Status<>',3)->WHERE('Urgency',1);
        $builder->limit(5);
        $data = $builder->get();
---
SELECT `OrderNo`, `Reason`, `DateNeeded`
FROM `tblprf`
WHERE `Status` <> 3
AND `Urgency` = 3
 LIMIT 5