app/Controllers/Dashboard.php

SELECT `OrderNo`, `Reason`, `DateNeeded`
FROM `tblprf`
WHERE `Status` <> 3
AND `Urgency` = 1
 LIMIT 5
---
    public function emergencyPRF()
    {
        $builder = $this->db->table('tblprf');
        $builder->select('OrderNo, Reason, DateNeeded');
        $builder->WHERE('Status<>',3)->WHERE('Urgency',1);
        $builder->limit(5);
        $data = $builder->get();

SELECT `OrderNo`, `Reason`, `DateNeeded`
FROM `tblprf`
WHERE `Status` <> 3
AND `Urgency` = 2
 LIMIT 5
---
    public function urgentPRF()
    {
        $builder = $this->db->table('tblprf');
        $builder->select('OrderNo, Reason, DateNeeded');
        $builder->WHERE('Status<>',3)->WHERE('Urgency',2);
        $builder->limit(5);
        $data = $builder->get();