app/Controllers/Home.php

    public function dashboard()
    {
        //total PRF request per date
        $builder = $this->db->table('tblprf');
        $builder->select('DateCreated,COUNT(prfID)total');
        $builder->groupBy('DateCreated');
        $query = $builder->get()->getResult();
---
SELECT `DateCreated`, COUNT(prfID)total
FROM `tblprf`
GROUP BY `DateCreated`

    public function addReport()
    {
        $user = session()->get('loggedUser');
        $builder = $this->db->table('tbldamagereport a');
        $builder->select('a.*,b.productName');
        $builder->join('tblinventory b','b.inventID=a.inventID','LEFT');
        $builder->WHERE('a.accountID',$user);
        $damage = $builder->get()->getResult();
        //repair
        $builder = $this->db->table('tblrepairreport a');
        $builder->select('a.*,c.productName');
        $builder->join('tbldamagereport b','b.reportID=a.reportID','LEFT');
        $builder->join('tblinventory c','c.inventID=b.inventID','LEFT');
        $builder->WHERE('a.accountID',$user);
        $builder->groupby('a.rrID');
        $repair = $builder->get()->getResult();
        //transfer request
        $builder = $this->db->table('tbltransfer_request');
        $builder->select('*');
        $builder->WHERE('accountID',$user);
        $request = $builder->get()->getResult();
        //return order
        $builder = $this->db->table('tblreturn a');
        $builder->select('a.*,b.supplierName');
        $builder->join('tblsupplier b','b.supplierID=a.supplierID','LEFT');
        $builder->WHERE('a.accountID',$user);
        $returnOrder = $builder->get()->getResult();
---
SELECT `a`.*, `b`.`productName`
FROM `tbldamagereport` `a`
LEFT JOIN `tblinventory` `b` ON `b`.`inventID`=`a`.`inventID`
WHERE `a`.`accountID` = '2'
SELECT `a`.*, `c`.`productName`
FROM `tblrepairreport` `a`
LEFT JOIN `tbldamagereport` `b` ON `b`.`reportID`=`a`.`reportID`
LEFT JOIN `tblinventory` `c` ON `c`.`inventID`=`b`.`inventID`
WHERE `a`.`accountID` = '2'
GROUP BY `a`.`rrID`
SELECT *
FROM `tbltransfer_request`
WHERE `accountID` = '2'
SELECT `a`.*, `b`.`supplierName`
FROM `tblreturn` `a`
LEFT JOIN `tblsupplier` `b` ON `b`.`supplierID`=`a`.`supplierID`
WHERE `a`.`accountID` = '2'

    public function profile()
    {
        $user = session()->get('loggedUser');
        $builder = $this->db->table('tblaccount a');
        $builder->select('a.username,a.Fullname,a.systemRole,a.Status,b.warehouseName,b.Address');
        $builder->join('tblwarehouse b','b.warehouseID=a.warehouseID','LEFT');
        $builder->WHERE('a.accountID',$user);
        $account = $builder->get()->getResult();
---
SELECT `a`.`username`, `a`.`Fullname`, `a`.`systemRole`, `a`.`Status`, `b`.`warehouseName`, `b`.`Address`
FROM `tblaccount` `a`
LEFT JOIN `tblwarehouse` `b` ON `b`.`warehouseID`=`a`.`warehouseID`
WHERE `a`.`accountID` = '5'

    public function Assign()
    {
        $canvasFormModel = new \App\Models\canvasFormModel();
        $user = session()->get('loggedUser');
        $builder = $this->db->table('tblassignment a');
        $builder->select('a.Status,b.prfID,b.OrderNo,b.Remarks,a.Date,b.DateNeeded,b.Reason,b.Department,c.Fullname,a.assignID,e.Fullname as Staff');
        $builder->join('tblprf b','b.prfID=a.prfID','LEFT');
        $builder->join('tblaccount c','c.accountID=b.accountID','LEFT');
        $builder->join('tblaccount e','e.accountID=a.accountID','LEFT');
        $builder->groupby('a.assignID');
        $list = $builder->get()->getResult();
        //pending
        $builder = $this->db->table('tblassignment a');
        $builder->select('a.Status,b.prfID,b.OrderNo,b.Remarks,a.Date,b.DateNeeded,b.Reason,b.Department,c.Fullname,a.assignID');
        $builder->join('tblprf b','b.prfID=a.prfID','LEFT');
        $builder->join('tblaccount c','c.accountID=b.accountID','LEFT');
        $builder->WHERE('a.accountID',$user)->WHERE('a.Status',0);
        $builder->groupby('a.assignID');
        $pending = $builder->get()->getResult();
---
SELECT `a`.`Status`, `b`.`prfID`, `b`.`OrderNo`, `b`.`Remarks`, `a`.`Date`, `b`.`DateNeeded`, `b`.`Reason`, `b`.`Department`, `c`.`Fullname`, `a`.`assignID`, `e`.`Fullname` as `Staff`
FROM `tblassignment` `a`
LEFT JOIN `tblprf` `b` ON `b`.`prfID`=`a`.`prfID`
LEFT JOIN `tblaccount` `c` ON `c`.`accountID`=`b`.`accountID`
LEFT JOIN `tblaccount` `e` ON `e`.`accountID`=`a`.`accountID`
GROUP BY `a`.`assignID`
SELECT `a`.`Status`, `b`.`prfID`, `b`.`OrderNo`, `b`.`Remarks`, `a`.`Date`, `b`.`DateNeeded`, `b`.`Reason`, `b`.`Department`, `c`.`Fullname`, `a`.`assignID`
FROM `tblassignment` `a`
LEFT JOIN `tblprf` `b` ON `b`.`prfID`=`a`.`prfID`
LEFT JOIN `tblaccount` `c` ON `c`.`accountID`=`b`.`accountID`
WHERE `a`.`accountID` = '6'
AND `a`.`Status` = 0
GROUP BY `a`.`assignID`

    public function stocksReport()
    {
        if(session()->get('role')=="Administrator"||session()->get('role')=="Editor")
        {
            $builder = $this->db->table('tblwarehouse');
            $builder->select('*');
            $warehouse = $builder->get()->getResult();
            //category
            $builder = $this->db->table('tblcategory');
            $builder->select('*');
            $category = $builder->get()->getResult();
            //account
            $builder = $this->db->table('tblaccount');
            $builder->select('*');
            $account = $builder->get()->getResult();
            //nearly expired
            $builder = $this->db->table('nearly_expired a');
            $builder->select('a.*,SUM(a.Qty)Qty,b.categoryName,c.supplierName,d.warehouseName');
            $builder->join('tblcategory b','b.categoryID=a.categoryID','LEFT');
            $builder->join('tblsupplier c','c.supplierID=a.supplierID','LEFT');
            $builder->join('tblwarehouse d','d.warehouseID=a.warehouseID','LEFT');
            $builder->groupby('a.warehouseID,a.inventID');
            $builder->orderby('a.Date');
            $items = $builder->get()->getResult();
---
SELECT *
FROM `tblwarehouse`
SELECT *
FROM `tblcategory`
SELECT *
FROM `tblaccount`
SELECT `a`.*, SUM(a.Qty)Qty, `b`.`categoryName`, `c`.`supplierName`, `d`.`warehouseName`
FROM `nearly_expired` `a`
LEFT JOIN `tblcategory` `b` ON `b`.`categoryID`=`a`.`categoryID`
LEFT JOIN `tblsupplier` `c` ON `c`.`supplierID`=`a`.`supplierID`
LEFT JOIN `tblwarehouse` `d` ON `d`.`warehouseID`=`a`.`warehouseID`
GROUP BY `a`.`warehouseID`, `a`.`inventID`
ORDER BY `a`.`Date`

    public function localPurchase()
    {
        $user = session()->get('loggedUser');
        $builder = $this->db->table('tblcanvass_review a');
        $builder->select('a.DateReceived,a.Reference,b.DateNeeded,b.Department,a.Status,c.Fullname,b.OrderNo,a.accountID,c.Department as Dept');
        $builder->join('tblcanvass_form b','b.Reference=a.Reference','LEFT');
        $builder->join('tblaccount c','c.accountID=b.accountID','LEFT');
        $builder->WHERE('a.accountID',$user);
        $builder->groupBy('a.crID')->orderby('a.crID','DESC');
        $list = $builder->get()->getResult();
---
SELECT `a`.`DateReceived`, `a`.`Reference`, `b`.`DateNeeded`, `b`.`Department`, `a`.`Status`, `c`.`Fullname`, `b`.`OrderNo`, `a`.`accountID`, `c`.`Department` as `Dept`
FROM `tblcanvass_review` `a`
LEFT JOIN `tblcanvass_form` `b` ON `b`.`Reference`=`a`.`Reference`
LEFT JOIN `tblaccount` `c` ON `c`.`accountID`=`b`.`accountID`
WHERE `a`.`accountID` = '6'
GROUP BY `a`.`crID`
ORDER BY `a`.`crID` DESC

    public function purchaseOrder()
    {
        $builder = $this->db->table('tblcanvass_form a');
        $builder->select('a.DateNeeded,a.DatePrepared,a.Department,a.OrderNo,a.Reference,a.Attachment as file,b.Status,b.Comment,c.PurchaseType,c.Attachment');
        $builder->join('tblpurchase_logs b','b.Reference=a.Reference','LEFT');
        $builder->join('tblprf c','c.OrderNo=a.OrderNo','LEFT');
        $builder->WHERE('a.Status',4);
        $builder->groupBy('a.Reference');
        $canvass = $builder->get()->getResult();
        //load all the generated PO
        $builder = $this->db->table('tblpurchase_logs a');
        $builder->select('a.*,b.OrderNo,c.Supplier');
        $builder->join('tblcanvass_form b','b.Reference=a.Reference','LEFT');
        $builder->join('tblcanvass_sheet c','c.purchaseLogID=a.purchaseLogID','LEFT');
        $builder->groupBy('a.purchaseNumber');
        $purchase = $builder->get()->getResult();
---
SELECT `a`.`DateNeeded`, `a`.`DatePrepared`, `a`.`Department`, `a`.`OrderNo`, `a`.`Reference`, `a`.`Attachment` as `file`, `b`.`Status`, `c`.`PurchaseType`, `c`.`Attachment`
FROM `tblcanvass_form` `a`
LEFT JOIN `tblpurchase_logs` `b` ON `b`.`Reference`=`a`.`Reference`
LEFT JOIN `tblprf` `c` ON `c`.`OrderNo`=`a`.`OrderNo`
WHERE `a`.`Status` = 4
GROUP BY `a`.`Reference`
SELECT `a`.*, `b`.`OrderNo`, `c`.`Supplier`
FROM `tblpurchase_logs` `a`
LEFT JOIN `tblcanvass_form` `b` ON `b`.`Reference`=`a`.`Reference`
LEFT JOIN `tblcanvass_sheet` `c` ON `c`.`purchaseLogID`=`a`.`purchaseLogID`
GROUP BY `a`.`purchaseNumber`