app/Controllers/Home.php

    public function Assign()
    {
        $canvasFormModel = new \App\Models\canvasFormModel();
        $user = session()->get('loggedUser');
        $builder = $this->db->table('tblassignment a');
        $builder->select('a.Status,b.prfID,b.OrderNo,b.Remarks,a.Date,b.DateNeeded,b.Reason,b.Department,c.Fullname,a.assignID,e.Fullname as Staff');
        $builder->join('tblprf b','b.prfID=a.prfID','LEFT');
        $builder->join('tblaccount c','c.accountID=b.accountID','LEFT');
        $builder->join('tblaccount e','e.accountID=a.accountID','LEFT');
        $builder->groupby('a.assignID');
        $list = $builder->get()->getResult();
        //pending
        $builder = $this->db->table('tblassignment a');
        $builder->select('a.Status,b.prfID,b.OrderNo,b.Remarks,a.Date,b.DateNeeded,b.Reason,b.Department,b.Urgency,c.Fullname,a.assignID');
        $builder->join('tblprf b','b.prfID=a.prfID','LEFT');
        $builder->join('tblaccount c','c.accountID=b.accountID','LEFT');
        $builder->WHERE('a.accountID',$user)->WHERE('a.Status',0);
        $builder->groupby('a.assignID');
        $pending = $builder->get()->getResult();
---
SELECT `a`.*, `b`.`Fullname`
FROM `tblprf` `a`
LEFT JOIN `tblaccount` `b` ON `b`.`accountID`=`a`.`accountID`
WHERE `a`.`Status` = 5
SELECT `a`.`Status`, `b`.`prfID`, `b`.`OrderNo`, `b`.`Remarks`, `a`.`Date`, `b`.`DateNeeded`, `b`.`Reason`, `b`.`Department`, `c`.`Fullname`, `a`.`assignID`
FROM `tblassignment` `a`
LEFT JOIN `tblprf` `b` ON `b`.`prfID`=`a`.`prfID`
LEFT JOIN `tblaccount` `c` ON `c`.`accountID`=`b`.`accountID`
WHERE `a`.`accountID` = '6'
AND `a`.`Status` = 2
GROUP BY `a`.`assignID`