app/Controllers/Notification.php

    public function firstAlarm()
    {
        $builder = $this->db->table('tblprf');
        $builder->select('COUNT(prfID)total');
        $builder->WHERE('Status<>',3)->WHERE('TIMESTAMPDIFF(Day, DateCreated, CURDATE())',5);
        $data = $builder->get();
        if($row = $data->getRow())
        {
            if($row->total==0)
            {
                //do nothing
            }
            else
            {
                //get all editors account except MIS
                $role = ['Administrator','Editor'];
                $builder = $this->db->table('tblaccount');
                $builder->select('Email,Fullname');
                $builder->WHEREIN('systemRole',$role)->WHERE('Status',1)->WHERE('Department!=','MIS');
                $data = $builder->get();
---
SELECT *
FROM `tblaccount`
WHERE `systemRole` IN ('Administrator','Editor')
AND `Department` != 'MIS'
AND `Status` = 1
 LIMIT 1