app/Controllers/Purchase.php

SELECT *
FROM `tblaccount`
WHERE `Status` = 1
AND `systemRole` IN ('Editor','Administrator')
AND `Department` NOT IN ('','MIS')
AND `accountID` <> '5'
---
    public function getEditor()
    {
        if(str_contains(session()->get('location'), 'FCM'))
        {
            $builder = $this->db->table('tblaccount');
            $builder->select('*');
            $builder->WHERE('Status',1)->WHERE('systemRole','Editor')->WHERE('Department','Technical Support');
            $data = $builder->get();
            foreach($data->getResult() as $row)
            {
                ?>
                <option value="<?php echo $row->accountID ?>"><?php echo $row->Fullname ?> - <?php echo $row->Department ?></option>
                <?php
            }
        }
        else
        {
            $user = session()->get('loggedUser');
            $role = ['Editor','Administrator'];
            $department = ['','MIS'];
            $builder = $this->db->table('tblaccount');
            $builder->select('*');
            $builder->WHERE('Status',1)->WHEREIN('systemRole',$role)->WHERENOTIN('Department',$department)->WHERE('accountID<>',$user);
            $data = $builder->get();