app/Controllers/Purchase.php

    public function getEditor()
    {
        if(str_contains(session()->get('location'), 'FCM'))
        {
            $builder = $this->db->table('tblaccount');
            $builder->select('*');
            $builder->WHERE('Status',1)->WHERE('systemRole','Editor')->WHERE('Department','Technical Support');
            $data = $builder->get();
            foreach($data->getResult() as $row)
            {
                ?>
                <option value="<?php echo $row->accountID ?>"><?php echo $row->Fullname ?> - <?php echo $row->Department ?></option>
                <?php
            }
        }
        else
        {
            $user = session()->get('loggedUser');
            $role = ['Editor','Administrator'];
            $department = ['','MIS'];
            $builder = $this->db->table('tblaccount');
            $builder->select('*');
            $builder->WHERE('Status',1)->WHEREIN('systemRole',$role)->WHERENOTIN('Department',$department)->WHERE('accountID<>',$user);
            $data = $builder->get();
---
SELECT *
FROM `tblaccount`
WHERE `Status` = 1
AND `systemRole` IN ('Editor','Administrator')
AND `Department` NOT IN ('','MIS')
AND `accountID` <> '2'

    public function transferPRF()
    {
        $systemLogsModel = new \App\Models\systemLogsModel();
        $purchaseModel = new \App\Models\purchaseModel();
        //data
        $old_user = $this->request->getPost('user');
        $new_user = $this->request->getPost('new_user');
        //validate
        $validation = $this->validate([
            'user'=>'required','new_user'=>'required'
        ]);
        if(!$validation)
        {
            echo "Please fill in the form";
        }
        else
        {
            //get the pending PRF from original requestor
            $status = [2,3];
            $builder = $this->db->table('tblprf');
            $builder->select('prfID');
            $builder->WHERE('accountID',$old_user)->WHERENOTIN('Status',$status);
            $data = $builder->get();
---
SELECT `prfID`
FROM `tblprf`
WHERE `accountID` = '2'